#
# chip's global brewfile
#
# descriptions of apps that replace, augment, or depend on
# other apps are formatted like '<original>: <description>'
#

# ===============================
# 🚰 taps
# ===============================

# homebrew auto updater
tap "domt4/autoupdate"
brew "autoupdate"

# macOS settings manager
tap "dsully/tap"
brew "macos-defaults"

# shell beautification tools
tap "charmbracelet/tap"
brew "wishlist"
brew "gum"

# ===============================
# 🧪 formulae
# ===============================

## shell
brew 'fish' # main shell
brew 'starship' # prompt
brew 'atuin' # shell history
brew 'shellcheck' # bash linter
brew 'shfmt' # bash formatter

## replacements / coreutils
brew 'bat' # cat: file viewer
brew 'fd' # find: file search
brew 'eza' # ls: dir listing
brew 'zoxide' # cd: navigation
brew 'tre-command' # tree: dir visualizer
brew 'curl' # curl: data transfer
brew 'wget' # wget: downloader
brew 'btop' # htop: resource monitor
brew 'micro' # nano: text editor
brew 'ripgrep' # grep: fast search
brew 'coreutils' # gnu: basic commands
brew 'macchina' # neofetch: system info

## version control
brew 'git' # source control
brew 'git-lfs' # git: large file storage
brew 'gh' # git: github cli
brew 'act' # gh: github actions
brew 'less' # pager
brew 'git-delta' # less: diff viewer

## languages
brew 'rustup' # rust
brew 'python' # python
brew 'pipx' # python 
brew 'bun' # typescript
brew 'yq' # yaml

## networking
brew 'openssh' # secure shell
brew 'iperf3' # benchmark tool
brew 'nmap' # thorough port scanner
brew 'caddy' # web server/reverse proxy

## multimedia
brew 'imagemagick' # image processing
brew 'ffmpeg' # video processing
brew 'yt-dlp' # media downloader
brew 'freetype' # font toolkit
brew 'chafa' # image viewer

## other
brew 'fswatch' # file change monitor
brew 'fzf' # fuzzy finder
brew 'folderify' # custom folder icons
brew 'gnupg' # encryption
brew 'pinentry-mac' # auth dialog
brew 'trash' # safe delete
brew 'grc' # colorizer

# ===============================
# 🛢️ casks
# ===============================

## fonts
cask 'font-commit-mono-nerd-font'
cask 'font-comic-mono'

## replacements / system
cask 'raycast' # spotlight: launcher
cask 'alt-tab' # stage manager: window switcher
cask 'betterdisplay' # settings: display
cask 'iina' # quicktime: video player
cask 'obs' # quicktime: screen recorder
cask 'cleanshot' # screenshots
cask 'keka' # file archiver
cask 'transmission' # torrent client

## productivity
cask 'cursor' # text editor / main IDE
cask 'obsidian' # text editor / markdown
cask '1password@nightly' # password manager
cask '1password-cli@beta' # 1password: CLI
cask 'google-chrome' # web browser
cask 'discord' # chat client

# ===============================
# 🍎 app store
# ===============================

brew 'mas' # mac app store cli
mas 'Passepartout, VPN Client', id: 1433648537 # multi-platform vpn client
mas 'Yoink - Better Drag and Drop', id: 457622435 # file pocket thing