#
# chip's global brewfile
#

# ===============================
# 🚰 taps
# ===============================

tap "domt4/autoupdate" # autoupdater
brew "autoupdate"

tap "buo/cask-upgrade"
brew "cask-upgrade"

tap "dsully/tap" # system settings
brew "macos-defaults"

# ===============================
# 🧪 formulae
# ===============================

## shell & scripting
brew 'fish' # shell
brew 'starship' # prompt
brew 'gum' # prettifier
brew 'atuin' # history
brew 'yq' # yaml processor
brew 'groff' # text formatting

## replacements
brew 'bat' # cat: file viewer
brew 'fd' # find: file search
brew 'eza' # ls: dir listing
brew 'zoxide' # cd: navigation
brew 'tre-command' # tree: dir visualizer
brew 'curl' # curl: data transfer
brew 'wget' # wget: downloader
brew 'btop' # htop: resource monitor
brew 'micro' # nano: text editor
brew 'ripgrep' # grep: fast search
brew 'coreutils' # gnu: basic commands

## utilities
brew 'fswatch' # file change monitor
brew 'fzf' # fuzzy finder
brew 'macchina' # system info
brew 'less' # pager
brew 'git-delta' # diff viewer
brew 'folderify' # custom folder icons
brew 'gnupg' # encryption
brew 'pinentry-mac' # auth dialog
brew 'nvim' # text editor
brew 'trash' # safe delete
brew 'iperf3' # network testing
brew 'openssh' # secure shell
brew 'grc' # colorizer

## multimedia
brew 'imagemagick' # image processing
brew 'ffmpeg' # video processing
brew 'yt-dlp' # media downloader
brew 'freetype' # font toolkit

## development
brew 'git' # version control
brew 'git-lfs' # large file storage
brew 'gh' # github cli
brew 'act' # github actions
brew 'rustup' # rust
brew 'node' # nodejs runtime
brew 'bun' # bun runtime
brew 'caddy' # web server/reverse proxy
brew 'python' # python
brew 'pipx' # python package manager 

# ===============================
# 🛢️ casks
# ===============================

## fonts
cask 'font-commit-mono-nerd-font'
cask 'font-comic-mono'

## utilities
cask 'keka' # file archiver
cask 'cleanshot' # screenshot tool
cask 'raycast' # spotlight replacement
cask 'betterdisplay' # display mgmt
cask 'alt-tab' # window switcher
cask 'transmission' # torrent client
cask 'obs' # screen recorder
cask 'iina' # video player

## productivity
cask 'cursor' # ai-powered ide
cask 'msty' # llm frontend
cask 'wezterm@nightly' # main terminal
cask 'warp' # alt. terminal
cask '1password@nightly' # password manager
cask '1password-cli@beta' # password manager cli
cask 'google-chrome' # web browser
cask 'obsidian' # markdown editor
cask 'discord' # chat
cask 'godot' # game engine
cask 'docker' # containers

# ===============================
# 🍎 app store
# ===============================

brew 'mas' # mac app store cli
mas 'Passepartout, VPN Client', id: 1433648537 # multi-platform vpn client
mas 'Yoink - Better Drag and Drop', id: 457622435 # drag-and-drop
