#
# chip's global brewfile
#
# descriptions of apps that replace, augment, or depend on
# other apps are formatted like '<original>: <description>'
#

# ===============================
# 🚰 taps
# ===============================

# homebrew auto updater
tap "domt4/autoupdate"
brew "autoupdate"

# macos settings manager
tap "dsully/tap"
brew "macos-defaults"

# shell beautification tools
tap "charmbracelet/tap"
brew "wishlist"
brew "gum"

# ===============================
# 🧪 formulae
# ===============================

## shell & terminal utilities
brew 'fish' # main shell
brew 'starship' # prompt
brew 'atuin' # shell history
brew 'nano' # nano: text editor
brew 'bat' # cat: file viewer
brew 'fd' # find: file search
brew 'eza' # ls: dir listing
brew 'ripgrep' # grep: fast search
brew 'zoxide' # cd: navigation
brew 'tre-command' # tree: dir visualizer
brew 'fzf' # fuzzy finder
brew 'less' # pager
brew 'coreutils' # gnu: basic commands
brew 'btop' # htop: resource monitor
brew 'macchina' # neofetch: system info
brew 'fastfetch' # system info, a la neofetch
brew 'cmatrix' # matrix digital rain effect
brew 'grc' # colorizer
brew 'duti' # utility to set default applications for file types
brew 'trash' # safe delete

## development 
brew 'git' # source control
brew 'git-lfs' # git: large file storage
brew 'gh' # git: github cli
brew 'act' # gh: github actions
brew 'git-delta' # less: diff viewer
brew 'docker' # containers
brew 'docker-credential-helper' # credentials helper for macos keychain
brew 'rustup' # rust
brew 'python' # python
brew 'pipx' # python
brew 'bun' # typescript
brew 'uv' # python package installer and resolver
brew 'shellcheck' # bash linter
brew 'shfmt' # bash formatter
brew 'jq' # json processor
brew 'yq' # yaml processor
brew 'languagetool' # grammar checker

## networking
brew 'curl' # curl: data transfer
brew 'wget' # wget: downloader
brew 'openssh' # secure shell
brew 'iperf3' # benchmark tool
brew 'nmap' # thorough port scanner
brew 'caddy' # web server/reverse proxy
brew 'dnsperf' # dns performance testing tool
brew 'fswatch' # file change monitor

## multimedia & graphics
brew 'imagemagick' # image processing
brew 'ffmpeg' # video processing
brew 'yt-dlp' # media downloader
brew 'freetype' # font toolkit
brew 'chafa' # image viewer
brew 'folderify' # custom folder icons

## security & privacy
brew 'gnupg' # encryption
brew 'pinentry-mac' # auth dialog

# ===============================
# 🛢️ casks
# ===============================

## fonts
cask 'font-comic-mono' # for use in IDE
cask 'font-commit-mono-nerd-font' # for use in terminal

## development 
cask 'cursor' # main IDE
cask 'obsidian' # personal knowledge base
cask 'ghostty@tip' # terminal emulator
cask 'figma@beta' # design tool
cask 'godot-dev' # game engine

## communication
cask 'brave-browser' # main browser
cask 'google-chrome' # development browser
cask 'vesktop' # custom discord client
cask 'claude' # ai assistant application

## system
cask 'raycast' # spotlight: launcher
cask 'alt-tab' # stage manager: window switcher
cask 'betterdisplay' # settings: display
cask 'mos' # mouse utilities
cask 'appcleaner' # application uninstaller
cask 'cleanshot' # screenshots
cask 'keka' # file archiver
cask 'transmission' # torrent client
cask '1password@nightly' # password manager
cask '1password-cli@beta' # 1password: cli

## multimedia
cask 'iina' # video player
cask 'obs' #  screen recorder
cask 'blender' # free and open source 3d creation suite
cask 'spotify' # music streaming service
cask 'steam' # digital distribution platform for video games
cask 'moonlight' # local game streaming client
cask 'languagetool' # grammar checker

# ===============================
# 🍎 app store
# ===============================

brew 'mas' # mac app store cli
mas 'Passepartout, VPN Client', id: 1433648537 # multi-platform vpn client
mas 'Yoink - Better Drag and Drop', id: 457622435 # file pocket thing